def get_sample_rows():
    """
    Повертаємо дані у форматі, начебто це рядки з таблиці.
    Поки що без pandas, щоб логіка трансформації була максимально зрозумілою.
    """
    return [
        {
            "Дата": "01.01.2025",
            "Область": "Тернопільська",
            "Місто": "Тернопіль",
            "Значення 1": 5,
            "Значення 2": 3,
            "Значення 3": 0,
            "Значення 4": 0,
            "Значення 5": 0,
            "Значення 6": 0,
            "Значення 7": 0,
            "Значення 8": 0,
            "Значення 9": 0,
            "Значення 10": 0,
            "long": 30.252525,
            "lat": 50.252525,
        }
    ]
